{
    "key": "software-application",
    "name": "Software - Application",
    "symbol": "^YH31110020",
    "sector_key": "technology",
    "sector_name": "Technology",
    "overview": {
        "companies_count": 249,
        "market_cap": 2474344710144,
        "message_board_id": "INDEXYH31110020",
        "description": "Companies that primarily design, develop, market, and support application software programs, including those that are cloud-based, for specific consumer and business functions.",
        "industries_count": null,
        "market_weight": 0.13956624,
        "employee_count": 763842
    },
    "research_reports": [
        {
            "id": "ARGUS_43003_InsiderActivity_1742554496000",
            "headHtml": "Daily – Vickers Top Insider Picks for 03/21/2025",
            "provider": "Argus Research",
            "reportDate": "2025-03-21T10:54:56Z",
            "reportTitle": "The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months.",
            "reportType": "Insider Activity"
        },
        {
            "id": "ARGUS_6070_AnalystReport_1742467880000",
            "headHtml": "Analyst Report: DocuSign Inc",
            "provider": "Argus Research",
            "targetPriceStatus": "Maintained",
            "investmentRating": "Neutral",
            "reportDate": "2025-03-20T10:51:20Z",
            "reportTitle": "DocuSign Inc. provides electronic signature or e-signature tools, enabling users to digitally sign and send agreements securely through a wide variety of devices. The company initially served the U.S. market, but has expanded internationally (primarily in Canada, the UK, Australia, and Japan) and now has customers in 187 countries. It generates 28% of its revenue outside the U.S. DocuSign completed its initial public offering in April 2018 at $29 per share.",
            "reportType": "Analyst Report"
        },
        {
            "id": "ARGUS_42988_MarketSummary_1742466980000",
            "headHtml": "Market Digest: CRL, DOCU",
            "provider": "Argus Research",
            "reportDate": "2025-03-20T10:36:20Z",
            "reportTitle": "Is the Consumer Moving to the Sidelines? When the U.S. Federal Reserve Bank is neither cutting nor raising rates, it is often described as having 'moved to the sidelines.' The Fed began cutting rates in March 2022. Sixteen months and more than five percentage points later, the Fed halted in July 2023 and was on the sidelines holding rates steady for eight straight meetings. After rate cuts in September, November and December 2024, the Fed is again expected to remain inactive at least through mid-year and potentially for all of 2025.  The sidelines are at risk of getting crowded, as U.S. consumers also appear to be slowing their activity. Consumer sentiment reflects increasing caution and even pessimism across all tiers of the U.S. economy. Sentiment can be misleading, and can also change quickly. Retail spending is a more tangible indicator, and it has been weak in the 2025 year to date. Consumers are concerned that tariffs will push already expensive goods out of reach and that the ripple effect of federal job cuts will impact their communities.  On the upside, the savings rate has improved. Employment levels remain high, and higher savings represent potential cash to be put back into the economy. But that may not happen until government tariff policy becomes clearer and business leaders can plan confidently in a more-stable environment. Sentiment Sinks The University of Michigan Consumer Sentiment survey for March 2025 surprised to the downside and showed that Main Street is increasingly worried about the return of inflation. The sentiment index fell to 57.9, down about 11% from 64.7 in February and well below the 63.2 consensus estimate.  The index reached its lowest level since 2022 mainly on fears of rekindled inflation. Within the survey, the one-year outlook for inflation rose to 4.9%, its highest reading since 2022 -- the year in which inflation reached a 40-year high. By every measure, consumers are more worried than they were a year ago. The index of consumer sentiment at 57.3 was down from 85.0 a year earlier in March 2024. The current economic conditions index at 63.5 was down 23% year over year; and the index of consumer expectations at 54.2 was down 30% from March 2024. Sentiment indexes can split along partisan lines; during the Biden years, sentiment among Republicans was consistently below that among Democrats. For March 2025, according to survey officials, sentiment was weak across party lines and across nearly all demographics. Consumer Surveys Director Joanne Hsu reported that Republicans, despite their greater confidence following the election, posted a sizable 10% decline in expectations in March. Many consumers cited the high level of uncertainty around policy, as 'frequent gyrations in policy make it very difficult for consumers to plan for the future.' As sentiment declines, confidence erodes as well. The Conference Board's Consumer Confidence index for February 2025 declined by 7.0 points to 98.3, registering its largest monthly decline since August 2021. This index has declined for three consecutive months, bringing it to the bottom of the range that has prevailed since 2022. Consumers expressed worsening confidence in labor market conditions, future income, and future business conditions. Pessimism about future employment prospects reached a 10-month high.  The NFIB small business optimism index is also moving the wrong way after experiencing a huge bounce on President Trump's election win. Small businesses account for about half of all employment in the U.S., and weakness in this metric has been known to impact future hiring.  The NFIB small business optimism index fell by 2.1 percentage points in February 2025 to 100.7, down from 102.8 in January and the recent peak of 105.1 in December 2024. NFIB Chief Economist Bill Dunkelberg offered the following: 'Uncertainty is high and rising on Main Street.' Within the data, the percentage of business owners expecting the economy to improve fell 10 points from January to a net 37%, seasonally adjusted. Conversely, the percentage of owners raising average selling prices increased by 10 percentage points -- the largest monthly increase in nearly four years. Labor quality and inflation remain the chief concerns cited by small business owners.  Spending Caution The retail sales report for February showed improvement from a dismal January, but continued to signal weakness in spending. Overall U.S. retail sales for February rose 0.2% month over month, missing the 0.7% consensus forecast while recovering from a revised 1.2% decline for January. Retail sales for February 2025 were up 3.1% from those in February 2024, below the consensus outlook for about 3.5% annual growth in spending.   Excluding vehicles, retail sales rose 0.3% in February, up from January's 0.6% decline though below the 0.4% consensus call. Excluding vehicles and gasoline, retail sales growth of 0.5% was in line with economists' expectations. Control group sales, which strips out non-core sectors, rose a better than expected 1.0% month over month. According to the Census Bureau, some of the strongest month-over-month growth was in health & personal care retail (up 1.7% from January) and non-store (online) retailers (up 2.4%). Some of categories that were negative month-over month included food services & drinking places (down 1.5% month over month), gasoline stations (down 1.0%), clothing stores (down 0.6%), and electronics & appliance stores (down 0.2%). Department store sales were down 1.7% from January; this category was down 3.2% on a combined two-month basis from end-of-year 2024. In terms of the annual change, some of the categories showing good growth included non-store retailers, furniture and home furnishings, food & beverage stores, and health & personal care stores. Sales at electronics & appliance stores were down a sharp 5.3% annually, suggesting that consumers have been avoiding buying new laptops and dishwashers in the past year. The U.S. unemployment rate remains low at a recent 4.1% for February. That has helped consumers rebuild their personal savings. According to the FRED economic data compiled by the Federal Reserve Bank of St. Louis, personal savings as a percentage of disposable personal income reached 4.6% in January 2025. This series hit a low of 2.0% in June 2022, when raging inflation put new strains on spending. The savings rate hit a high above 12% in the early months of the COVID-19 pandemic, when many stores were closed. At a current savings rate near 5%, consumers have 'dry powder' that can be deployed in the retail economy. However, first they have to be confident that prices are not about to run higher again. Conclusion We have expressed our concern that tariffs could hit differently in 2025 than in 2017. Consumers have been battered by inflation for the past several years and many are expressing that they are at the edge of their spending limits. In 2017, by contrast, consumers were coming off a decade of below-trend inflation. Businesses and consumers in that earlier period were better able to absorb tariff-induced price increases and the economy chugged along.  Generals are always at risk of 'fighting the last war,' and that thinking can permeate business leaders and politicians as well. The second Trump administration may be basing its trade policies on the relatively benign impact of that first round of tariffs. Despite the first widespread implementation of tariffs in U.S. since the Smoot-Hawley Act in 1930, GDP grew 2.5% in 2017, 3.0% in 2018, and 2.5% in 2019. COVID-19 impacted growth in 2020. Investors as always need to respond to circumstances as they are, not to the way things were. The chief concern among investors has been that tariffs would rekindle inflation. But to get inflation you have to have spending. If consumers really are moving to the sidelines, their contribution to GDP (70% of total) could be diminished, leading to below-trend economic growth.",
            "reportType": "Market Summary"
        },
        {
            "id": "ARGUS_42987_TopBottomInsiderActivity_1742466888000",
            "headHtml": "Daily – Vickers Top Buyers & Sellers for 03/20/2025",
            "provider": "Argus Research",
            "reportDate": "2025-03-20T10:34:48Z",
            "reportTitle": "The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.",
            "reportType": "Top/Bottom Insider Activity"
        }
    ],
    "top_companies": {
        "name": {
            "CRM": "Salesforce, Inc.",
            "NOW": "ServiceNow, Inc.",
            "ADBE": "Adobe Inc.",
            "INTU": "Intuit Inc.",
            "UBER": "Uber Technologies, Inc.",
            "ADP": "Automatic Data Processing, Inc.",
            "APP": "AppLovin Corporation",
            "CDNS": "Cadence Design Systems, Inc.",
            "MSTR": "MicroStrategy Incorporated",
            "WDAY": "Workday, Inc.",
            "ROP": "Roper Technologies, Inc.",
            "TEAM": "Atlassian Corporation",
            "ADSK": "Autodesk, Inc.",
            "SNOW": "Snowflake Inc.",
            "PAYX": "Paychex, Inc.",
            "FICO": "Fair Isaac Corporation",
            "DDOG": "Datadog, Inc.",
            "HUBS": "HubSpot, Inc.",
            "ANSS": "ANSYS, Inc.",
            "TTD": "The Trade Desk, Inc.",
            "TYL": "Tyler Technologies, Inc.",
            "ZM": "Zoom Communications Inc.",
            "SSNC": "SS&C Technologies Holdings, Inc.",
            "PTC": "PTC Inc.",
            "DOCU": "DocuSign, Inc.",
            "AZPN": "Aspen Technology, Inc.",
            "GWRE": "Guidewire Software, Inc.",
            "DT": "Dynatrace, Inc.",
            "DUOL": "Duolingo, Inc.",
            "MNDY": "monday.com Ltd.",
            "BSY": "Bentley Systems, Incorporated",
            "PAYC": "Paycom Software, Inc.",
            "PCTY": "Paylocity Holding Corporation",
            "PCOR": "Procore Technologies, Inc.",
            "MANH": "Manhattan Associates, Inc.",
            "ESTC": "Elastic N.V.",
            "ALTR": "Altair Engineering Inc.",
            "DAY": "Dayforce Inc",
            "U": "Unity Software Inc.",
            "SMAR": "Smartsheet Inc.",
            "APPF": "AppFolio, Inc.",
            "CVLT": "Commvault Systems, Inc.",
            "SRAD": "Sportradar Group AG",
            "CWAN": "Clearwater Analytics Holdings, Inc.",
            "PEGA": "Pegasystems Inc.",
            "CCCS": "CCC Intelligent Solutions Holdings Inc.",
            "VERX": "Vertex, Inc.",
            "IDCC": "InterDigital, Inc.",
            "QXO": "QXO, Inc.",
            "LYFT": "Lyft, Inc."
        },
        "rating": {
            "CRM": "Buy",
            "NOW": "Buy",
            "ADBE": "Buy",
            "INTU": "Buy",
            "UBER": "Buy",
            "ADP": "Hold",
            "APP": "Buy",
            "CDNS": "Buy",
            "MSTR": "Strong Buy",
            "WDAY": "Buy",
            "ROP": "Buy",
            "TEAM": "Buy",
            "ADSK": "Buy",
            "SNOW": "Buy",
            "PAYX": "Hold",
            "FICO": "Buy",
            "DDOG": "Buy",
            "HUBS": "Buy",
            "ANSS": "Hold",
            "TTD": "Buy",
            "TYL": "Buy",
            "ZM": "Buy",
            "SSNC": "Buy",
            "PTC": "Buy",
            "DOCU": "Hold",
            "AZPN": "Buy",
            "GWRE": "Buy",
            "DT": "Buy",
            "DUOL": "Buy",
            "MNDY": "Strong Buy",
            "BSY": "Buy",
            "PAYC": "Hold",
            "PCTY": "Buy",
            "PCOR": "Buy",
            "MANH": "Strong Buy",
            "ESTC": "Buy",
            "ALTR": "Hold",
            "DAY": "Buy",
            "U": "Buy",
            "SMAR": "Hold",
            "APPF": "Buy",
            "CVLT": "Buy",
            "SRAD": "Buy",
            "CWAN": "Strong Buy",
            "PEGA": "Buy",
            "CCCS": "Buy",
            "VERX": "Buy",
            "IDCC": "Buy",
            "QXO": null,
            "LYFT": "Buy"
        },
        "market weight": {
            "CRM": 0.11659182,
            "NOW": 0.07414327,
            "ADBE": 0.07400997,
            "INTU": 0.07340615,
            "UBER": 0.06933211,
            "ADP": 0.052241083,
            "APP": 0.045753073,
            "CDNS": 0.031246522,
            "MSTR": 0.03091349,
            "WDAY": 0.028811928,
            "ROP": 0.026636824,
            "TEAM": 0.025704512,
            "ADSK": 0.025004642,
            "SNOW": 0.02269722,
            "PAYX": 0.022346718,
            "FICO": 0.019590361,
            "DDOG": 0.015490871,
            "HUBS": 0.0135878865,
            "ANSS": 0.012308648,
            "TTD": 0.012066334,
            "TYL": 0.010524045,
            "ZM": 0.01010888,
            "SSNC": 0.00885525,
            "PTC": 0.0083362525,
            "DOCU": 0.0077598705,
            "AZPN": 0.0072584255,
            "GWRE": 0.0069451686,
            "DT": 0.0064559816,
            "DUOL": 0.005906335,
            "MNDY": 0.0057459534,
            "BSY": 0.0055034147,
            "PAYC": 0.005464884,
            "PCTY": 0.0046446724,
            "PCOR": 0.0045424756,
            "MANH": 0.0045363065,
            "ESTC": 0.004373633,
            "ALTR": 0.0041327826,
            "DAY": 0.004005208,
            "U": 0.003768924,
            "SMAR": 0.003415099,
            "APPF": 0.0033972505,
            "CVLT": 0.003066222,
            "SRAD": 0.002887004,
            "CWAN": 0.0028440687,
            "PEGA": 0.0027136812,
            "CCCS": 0.0024440424,
            "VERX": 0.0024179125,
            "IDCC": 0.0023914825,
            "QXO": 0.0022521317,
            "LYFT": 0.0021575002
        }
    },
    "top_growth_companies": {
        "name": {
            "XPER": "Xperi Inc.",
            "BIGC": "BigCommerce Holdings, Inc.",
            "PRO": "PROS Holdings, Inc.",
            "DUOL": "Duolingo, Inc.",
            "APP": "AppLovin Corporation"
        },
        "ytd return": {
            "XPER": -0.222,
            "BIGC": -0.0212,
            "PRO": -0.0619,
            "DUOL": -0.046,
            "APP": -0.0303
        },
        " growth estimate": {
            "XPER": 80.0,
            "BIGC": 6.666666666666667,
            "PRO": 6.3999999999999995,
            "DUOL": 4.714285714285714,
            "APP": 2.7551020408163267
        }
    },
    "top_performing_companies": {
        "name": {
            "NTCL": "NetClass Technology Inc",
            "PRCH": "Porch Group, Inc.",
            "SSTI": "SoundThinking, Inc.",
            "SRAD": "Sportradar Group AG",
            "LGTY": "Logility Supply Chain Solutions, Inc."
        },
        "ytd return": {
            "NTCL": 0.7641,
            "PRCH": 0.3821,
            "SSTI": 0.3691,
            "SRAD": 0.2872,
            "LGTY": 0.2852
        },
        " last price": {
            "NTCL": 10.32,
            "PRCH": 6.8,
            "SSTI": 17.88,
            "SRAD": 22.32,
            "LGTY": 14.24
        },
        "target price": {
            "NTCL": NaN,
            "PRCH": 8.0,
            "SSTI": 22.3333,
            "SRAD": 23.0434,
            "LGTY": 14.3
        }
    }
}